label Petrushka:
    scene ozero_night
    #/Музика: Тривожна з переходом в спокійну/
    
    show Liza_4 at pos_liza
    show Poli_3 at pos_poli
    
    liza "Гадаю… Петрушка?"
    pause 1.5
    poli "То що в тебе сталося, серденько? Розповіси мені все, та, можливо, я тобі допоможу."
    liza "Хлопець, якого я, напевно, кохаю, зраджує мені з іншими дівчатами."
    pause 1.5
    liza "Спочатку він це приховував, але тепер, мабуть, зрозумів: я все одно не піду від нього, попри все…"
    pause 1.5
    poli "Чого ж ти тоді…"
    hide Liza_4
    hide poli_3
    show liza_2 at pos_liza
    show poli_4 at pos_poli
    liza "Я старалася! Старалася з усіх сил!"
    liza "Робила все як він скаже! Поводила себе так, як він хотів."    
    pause 1.5
    liza "Але мене ніколи не було достатньо..."
    liza "Недостатньо гарна, недостатньо кмітлива, недостатньо смішна, недостатньо…"
    pause 1.5
    liza "Я так втомилась…"
    poli "Ой лишенько… Йди до мене, я тебе обійму, тобі стане краще..."
    scene hug
    liza "{italic}Вона така холодна… Цікаво як довго вона тут...{/italic}"
    pause 1.5
    liza "{italic}З нею так якось… спокійно? Вона неначе сховала мене від зовнішнього світу… Від всіх негараздів та тривожних думок.{/italic}"
    liza "{italic}Невже… Невже мені подобається? {/italic}"
    
    poli "Ну, що, стало краще?"
    
    scene ozero_night
    show liza_5 at pos_liza
    show poli_5 at pos_poli
    tele "Брінь-дінь-дінь. Брінь-дінь-дінь."
    liza "…"
    tele "Брінь-дінь-дінь. Брінь-дінь-дінь."
    
    poli "Щось не так?"
    liza "Мені… Мені вже треба бігти додому... Бувай"
    liza "Чи можу… Чи можемо ми зустрітись тут завтра?"

    poli "Я чекатиму на тебе…"

    scene forest_night
    #/Музика: Спокійна/
    #/Персонажі: без персонажів/
    liza "{italic}Щось підказує мені, що я не маю повертатись до Поліанни. Але поряд з нею мені стало так добре… Вона була такою дивною, такою турботливою, такою красивою… {/italic}"
    liza "{italic}Її темно сині очі, неначе нічне небо. Мене охопило відчуття, що я потонула в них, як тільки вона мене відпустила.{/italic}"
    liza "{italic}А її волосся здалось мені таким неймовірно м’яким, як би мені хотілося зануритись в нього обличчям і заснути.{/italic}"
    liza "{italic}А обійми… Холодні, що пробирають до самих кісток, але такі спокійні…{/italic}"
    pause 1.5
    liza "{italic}Я хочу знову побачитись з нею. Можливо ми навіть станемо подругами…{/italic}"

    jump day2Petr



