label day2Petr:
    scene forest_day
    # /Музика: Спокійна/
    show liza_6 at pos_liza
    
    liza "{italic}Сподіваюсь Поліанна прийде…{/italic}"
    liza "{italic}Може мені їй щось подарувати?{/italic}"

    scene ozero_day
    show liza_6 at pos_liza
    show poli_6 at pos_poli
    poli "Ви тільки-но подивіться хто ж це прийшов!"
    poli "Невже це моє сонечко!"
    pause 1.0
    hide liza_6 
    hide poli_6
    show liza_7 at pos_liza
    show poli_7 at pos_poli
    liza "{italic}Поліанна… назвала мене своєю? Сонечко? Це приємно, але якось дивно.{/italic}"
    poli "Хочеш я тобі дещо покажу? Але спочатку заплющ очі, не підглядай…"
    if not vorona1:
        call screen sc_vorona_ozero_day
    else:
        "dddddddd"
        jump day2Petr_2

label day2Petr_2:
    scene ozero_day
    hide liza_7
    show liza_8 at pos_liza
    liza "Так, хочу…"
    show black with fade
    liza "Тримай себе в руках, не витріщайся на неї… Не витріщайся!"
    hide black
    show poli_7 at pos_poli
    show liza_8 at pos_liza
    poli "І цееее… маленька квіточка! Гарна, правда ж?"
    hide liza_8
    show liza_9 at pos_liza
    liza "Так, дуже гарна..."
    liza "Це всього лиш квітка..."
    pause 1.5
    poli "Вона красивіша за мене?"
    show liza_9
    show liza_6 at pos_liza
    pause 1.5
    liza "Що? В сенсі?"
    poli "Ця квітка красивіша за мене?"
    liza "Ні-ні, я думаю ти красивіша!"
    poli "Не брешеш? Наскільки я красивіша за цю квітку?"
    pause 1.5
    liza "Я… я не знаю. На дуже?"
    poli "Ахахахаха. На дуже!"
    poli " "
    pause 1.0
    poli "Ходи до мене, серденько…"
    hide poli_7 
    show poli_8 at pos_poli
    liza "Навіщо?"
    pause 1.5
    poli "Невже ти боїшся мене? Нумо, ходи-но сюди"
    liza "{italic}Можливо зараз вона…{/italic}"
    scene holds_hands
    poli "Ти вся зашарілася. Мені подобається, яка ти мила."
    liza "{italic}Щ-що?{/italic}"
    liza "{italic}Що вона має на увазі?{/italic}"
    liza "{italic}Я їй подобаюсь?{/italic}"
    pause 1.5
    liza "Ти мені також…"
    pause 1.5
    poli "Га?"
    liza "…"
    liza "А, ні, нічого. Я просто…"
    poli "Подумала, що ти мені подобаєшся?"
    pause 1.5
    poli "Ахахаха…"
    poli "Моя ти хороша."
    poli "Що ж, я зовсім не проти, якщо це стане правдою"    
    scene hand
    pause  1.5
    liza "{italic}Знову цей холод. Я відчуваю як від її дотику поколює шкіру, але… це приємно… Заспокоює…{/italic}"
    liza "{italic}Мене ніби знову сховали від усіх проблем, я більше не почуваюсь самотньою. Поліанна поруч... поруч зі мною…{/italic}"
    liza "{italic}І ця біль... вона стає дедалі сильнішою...{/italic}"
    liza "Ай!"
    scene ozero_day
    show liza_10 at pos_liza
    show poli_9 at pos_poli
    poli "Вибач, я зробила тобі боляче?"
    liza "Ні-ні, все добре, просто..."
    pause 1.5
    liza "Чи зустрінемось ми знову? Можливо завтра?"
    poli "Так, я чекатиму на тебе тут, сонечко."
    hide poli_9
    show poli_10 at pos_poli
    liza "Давай підемо кудись ще? Може погуляємо в місті? Або ж сходимо в парк, якщо ти любиш природу? А давай…."
    hide poli_10
    show poli_11 at pos_poli
    poli "Ні, моя хороша, я не можу йти так далеко."
    liza "Ну, добре тоді... Я обов’язково навідаю тебе завтра!"
    #/Показуємо таймскіп/
    #/Сцена з календарем/
    scene calendar
    "13 серпня"
    liza "{italic}Мені здається Поліанна хоче подружитись. Добре до мене ставиться й вислуховує.{/italic}"
    liza "{italic}Ще, розказала мені про свого птаха, що інколи приносить різні речі. Вона сказала, що птах завжди спостерігає за нами. Це трошки дивно, але доволі мило.{/italic}"
    liza "{italic}Ще, я їй розказала, що мої батьки часто сваряться, та мені здається, що вони хочуть розлучитися.{/italic}"
    liza "{italic}…{/italic}"
    liza "{italic}Мене це лякає.{/italic}"
    "14 серпня"
    liza "Поліанна здивувалась коли я розказала, що не вмію плавати. Це її занепокоїло, і вона сказала, що може мене навчити."
    liza "Я погодилась й мене повили одразу в озеро, я трошки хвилювалася, бо не хотіла мочити одяг, а ще я інколи заглядаюсь на її тіло... Дивне відчуття. "
    liza "Під вечір, я подарувала їй маленький кулон в котрий вона може розмістити фотографію."
    liza "Було дуже ніяково від сорому, а ще більш ніяково коли Поліанна мене поцілувала в щічку... Гарний день."
    "15 серпня."
    liza "Поліанна мене налякала... коли вона продовжила вчити мене плавати, то несподівано почала лоскотати й я пішла під воду, а коли намагалась вибратись, то відчула, що її руки не дають мені виплисти."
    liza "Я... я думаю, що більше не хочу з нею дружити... В цей момент, я наче побачила її пташку під водою... Мені більше не хочеться приходити до неї. Поліанна мене лякає..."
    # На порозі вибору до фіналу
    jump preFinal
label day2Polyn:
    "Ця частина не закінчена"
    return