label no_water_ending:
    scene water_night
    show poli_15 at pos_poli
    show liza_12 at pos_liza
    liza "Ні... Я не хочу!"
    pause
    liza "Я не піду!"
    hide liza_12
    hide poli_15
    show poli_16 at pos_poli
    show liza_13 at pos_liza
    poli "Так, ти підеш зі мною!"
    poli "Ти МОЯ подруга! Ти маєш МЕНЕ слухати! Мене, мене... І тільки мене!"

    liza "Ти мене лякаєш... Я хочу додому, будь ласка..."

    poli "Стулися! Закрий рота!"
    poli "Ти маєш піти зі мною, зараз! Просто стулися — та йди!"

    liza "НІ! Ти мені не подруга! Ти лише хочеш..."

    # /звук ляпаса/
    # /флеш білий, поступово переходить у прозорість/
    show liza_14 at pos_liza
    liza "Щ-що т-ти..."


    liza "{italic}Вона мене вдарила?..{/italic}"
    liza "{italic}Щока горить... Мене наче обпекло холодом. Це відчувається... Як вона.{/italic}"
    liza "{italic}Боляче... Я не хочу плакати перед нею...{/italic}"
    hide poli_12
    show poli_17 at pos_poli
    poli "Ти хочеш мене покинути?! Як всі інші?!"
    # (пауза)
    liza "Я хочу додому... Мені страшно..."

    poli "Цього не буде! Ти нікуди не підеш! Не підеш! Не підеш!"

    # /сцена: Поліанна хапає дівчинку за волосся/
    scene took_by_the_hair

    # /тривожна музика/
    liza "Ай! Відпусти, благаю тебе! Не треба!"
    poli "Ніколи!.. Будеш зі мною... Завжди..."
    liza "Я не хочу! Відпусти мене!"
    liza "Не повернусь! Я тебе більше не потривожу... Просто дай мені піти! Будь ласка!"

    poli "Ти сама це вибрала! З самого початку не могло бути інакше!"
    poli "Ти залишишся тут!"

    # /Вмикаєм музику на фінал/

    liza "{italic}Що?.. Я не...{/italic}"
    # *тут було б гарно таким напівпрозорим показати фрейм, де гравець обирає петрушку*
    liza "{italic}Петрушка... Це все через це?.. Вона нічого не пояснила — як я могла зрозуміти?..{/italic}"

    # /звук падіння у воду/
    # /сцена: погляд від обличчя русалки/
    scene nooo_helpp

    poli "Не пручайся… Все буде добре. Ми будемо разом..."
    poli "Я тебе ніколи не покину."

    # /сцена: погляд від обличчя ЛІЗА/
    scene eheeeee_dieeeeeee

    liza "Холодно..."
    liza "Як я не помічала, до чого все йде?.."
    liza "Поліанна просто маніпулювала мною, щоб... Щоб що?"
    liza "Хотіла мене вбити?.. Так чому не зробила це одразу? Просто бавилась зі мною?.."
    liza "Можливо… Можливо вона також просто не хотіла залишитись сама? Її теж покинули… Тепер вона просто мститься?.. Але чому я?.."
    # (пауза)

    # /сцена темряви, музика стихає/
    show black
    with dissolve

    liza "Вона ж не людина, так?.. Від неї завжди віяло холодом, як від померлої.."
    liza "Її довге волосся, що просто лежало на воді тепер тягнеться до мене… Воно огортає мої руки, мої ноги..."
    liza "Не можу... рухатись..."
    liza "Я... не..."

    poli "Ти... лиш... м... я... н... за... ди... на... з-вжд..."

    liza "Я так більше не можу..."
    liza "Біль..."
    liza "ше..."

    window auto False
    window hide

    # /сцена з очима русалки через декілька секунд з прозорості/
    show eyea
    with slow_dissolve

    centered "{size=300}{shader=jitter:u__jitter=5.0, 10.0}Кінець{/shader}{/size}"(what_color=gui.accent_color)
    return
