label pre_final:
    scene ozero_night with slow_fade
    play music lake_ambience
    # /Музика: спокійна переходить в напряжну/
    pause 1.5
    show liza_11 at pos_liza
    with dissolve
    show poli_12 at pos_poli
    with dissolve

    poli "Подивіться-но хто прийшов!"
    liza "Т-так, я…"
    poli "В мене дещо є, показати?"
    liza "…"
    liza "Ні, я хочу… Я прийшла, щоб сказати тобі дещо важливе…"

    hide poli_12
    show poli_13 at pos_poli
    poli "Щось мені це вже не подобається…"
    liza "Дякую, що допомогла мені отямитись тоді. Але я подумала й… Я більше не буду приходити."
    poli "…"
    liza "Це неправильно. Так не має бути…"
    liza "У мене немає бажання приходити сюди. Я не хочу це продовжувати."

    hide poli_13
    show poli_14 at pos_poli
    poli "Чому? Що тобі не подобається?"
    liza "Не те щоб… я просто…"

    hide poli_14
    show poli_15 at pos_poli
    poli "Я думала, ми можемо подружитися. Стати ближчими, ніж зараз. Хіба я тобі не подобаюсь?"
    pause 1.5
    poli "Я можу допомогти тобі з твоїм хлопцем…"
    liza "Ти можеш? Що... Як?"
    poli "Я знаю, що тобі треба зробити, щоб він точно не захотів тобі зраджувати."
    poli "Він тебе ніколи не залишить, ти будеш щаслива."
    liza "Але ж…"
    poli "Тільки ти володітимеш його серцем. Назавжди. Хіба ти цього не хочеш?"

    hide liza_11
    show liza_12 at pos_liza
    liza "Напевно, хочу…"
    poli "Я знаю ти хочеш!  Тобі треба слухатись мене і тільки мене!"
    poli "Ніхто не зможе допомогти тобі так, як я!"
    poli "Він зміниться заради тебе!"
    liza "Ти мене лякаєш..."
    poli "А ВІН тебе не лякає? Його байдужість, неповага й постійна брехня?"
    poli "А батьки? Як вони до тебе ставляться? Не помічають, коли тобі погано, або коли ти потребуєш їхньої допомоги. Вони хоч колись звертають на тебе увагу? Та ніколи!"
    poli "У тебе є лише я. І тільки я можу вирішити всі твої проблеми!"
    poli "Ніхто у цілому світі не зможете тобі допомогти, окрім мене."
    pause 1.5
    poli "І я тобі допоможу. Тобі лишень треба мене слухатись."
    poli "А тепер – зайди у воду."

    menu:
        "Не йти в воду":
            jump no_water_ending
        "Зайти в воду":
            jump yes_water_ending
