label yes_water_ending:
    scene water_night with dissolve

    show liza 15 at pos_liza
    with dissolve
    liza "{italic}Він ніколи мене не покине... Він залишиться зі мною назавжди...{/italic}"
    "..."
    liza "{italic}Страшно...{/italic}"

    show poli 18 at pos_poli

    poli "Нумо, сміливіше. Скоро все закінчиться – і ти будеш щаслива."
    poli "Так, йди за мною. Я чекатиму на тебе..."

    scene water_night_silhouettes
    with dissolve

    "..."

    "{italic}Що подумають батьки? Чи зрозуміють, що були неправі? Чи зрозуміють, скільки болю мені завдали — і що тепер варто змінитись?..{/italic}"
    "..."
    "{italic}Мені страшно...{/italic}"
    "..."
    "{italic}Він... Він не зможе з цим жити і також зміниться заради мене?..{/italic}"
    "..."
    "{italic}Страшно...{/italic}"
    "{italic}Її силует такий красивий у місячному сяйві. Нас охоплює вир, що ніби підштовхує мене до неї...{/italic}"
    "{italic}Її волосся, що мирно лежало на воді, тепер розпливається в сторони, захоплює більше й більше води, так близько до мене, обвиває своєю прохолодою –  веде мене до неї...{/italic}"
    "{italic}Заспокоює...{/italic}"
    "{italic}Так тихо… Навіть всі птахи, мабуть, вже позасинали. Що я тут роблю...{/italic}"

    if not persistent.coll7_unlocked:
        show voron_nad_ozerom with dissolve
        call screen sc_voron_nad_ozerom
    else:
        jump yes_water_ending2
label yes_water_ending2:
    hide voron_nad_ozerom with dissolve
    liza "Ти хочеш мене втопити?..."
    "..."
    liza "Це – те рішення проблем, про яке ти казала?.."

    poli "Ми зможемо завжди бути разом. Жодні проблеми більше ніколи тебе не потурбують."
    poli "Всі пам’ятатимуть тебе найкращою, найгарнішою, люблячою донькою..."
    poli "Вони завжди так роблять. Згадують хороше лише тоді, коли ти цього більше не почуєш..."

    "{italic}Волосся Поліанни підіймається все вище...{/italic}"
    "{italic}Я вже не йду сама — вона тягне моє тіло за собою...{/italic}"
    "..."
    "{italic}Страшно?..{/italic}"
    "{italic}Вже не відчуваю землі, але все одно йду далі. Йду в пустому просторі, рухаюсь в прірву глибини й темряви...{/italic}"

    poli "Я люблю тебе. Люблю так, як ніхто нікого не любив. Ти навіть не уявляєш..."
    poli "Тепер ми завжди будемо разом."

    liza "Ми..."

    # /сцена темряви, музика стихає/
    scene black
    with dissolve
    play music romantic_keys

    "{italic}Я більше не відчуваю свого тіла.  Волосся Поліанни повністю огорнуло мене. Я знаю, що вона тягне мене так глибоко як може...{/italic}"
    "{italic}Останній раз я відчуваю як крихти страху блищать десь на осередках моєї свідомості і дуже швидко згасають...{/italic}"

    window auto False
    window hide

    # /сцена з очима русалки через декілька секунд з прозорості/
    scene eyea
    with slow_dissolve

    pause 2
    "У голові я чую лише шепіт Поліанни, яка каже:"
    extend "{italic}{cps=10}Навічно. {/cps}{/italic}"
    extend "{italic}{cps=10}Назавжди...{/cps}{/italic}"

    scene black
    with slow_dissolve
    stop music

    pause 3

    jump credits
