label yes_water_ending:
    scene water_night with dissolve
    # play music tense_music fadein 1

    show liza_15 at pos_liza
    with dissolve
    liza "{italic}Він ніколи мене не покине... Він залишиться зі мною назавжди...{/italic}"
    # (пауза)
    liza "{italic}Страшно...{/italic}"

    show poli_18 at pos_poli

    poli "Нумо, сміливіше. Скоро все закінчиться – і ти будеш щаслива."
    poli "Так, йди за мною. Я чекатиму на тебе..."

    scene water_night_silhouettes

    # (пауза)

    "{italic}Що подумають батьки? Чи зрозуміють, що були неправі? Чи зрозуміють, скільки болю мені завдали — і що тепер варто змінитись?..{/italic}"
    # (пауза)
    "{italic}Мені страшно...{/italic}"
    # (пауза)
    "{italic}Він... Він не зможе з цим жити і також зміниться заради мене?..{/italic}"
    # (пауза)
    "{italic}Страшно...{/italic}"
    "{italic}Її силует такий красивий у місячному сяйві. Нас охоплює вир, що ніби підштовхує мене до неї...{/italic}"
    "{italic}Її волосся, що мирно лежало на воді, тепер розпливається в сторони, захоплює більше й більше води, так близько до мене, обвиває своєю прохолодою –  веде мене до неї...{/italic}"
    "{italic}Заспокоює...{/italic}"
    "{italic}Так тихо… Навіть всі птахи, мабуть, вже позасинали. Що я тут роблю...{/italic}"

    liza "Ти хочеш мене втопити?.."
    # (пауза)
    liza "Це – те рішення проблем, про яке ти казала?.."

    poli "Ми зможемо завжди бути разом. Жодні проблеми більше ніколи тебе не потурбують."
    poli "Всі пам’ятатимуть тебе найкращою, найгарнішою, люблячою донькою..."
    poli "Вони завжди так роблять. Згадують хороше лише тоді, коли ти цього більше не почуєш..."

    "{italic}Волосся Поліанни підіймається все вище...{/italic}"
    "{italic}Я вже не йду сама — вона тягне моє тіло за собою...{/italic}"
    # (пауза)
    "{italic}Страшно?..{/italic}"
    "{italic}Вже не відчуваю землі, але все одно йду далі. Йду в пустому просторі, рухаюсь в прірву глибини й темряви...{/italic}"

    poli "Я люблю тебе. Люблю так, як ніхто нікого не любив. Ти навіть не уявляєш..."
    poli "Тепер ми завжди будемо разом."

    liza "Ми..."

    # /сцена темряви, музика стихає/
    show black
    with dissolve

    "{italic}Я більше не відчуваю свого тіла.  Волосся Поліанни повністю огорнуло мене. Я знаю, що вона тягне мене так глибоко як може...{/italic}"
    "{italic}Останній раз я відчуваю як крихти страху блищать десь на осередках моєї свідомості і дуже швидко згасають...{/italic}"
    # (пауза)
    "{italic}Навічно. Назавжди...{/italic}"

    window auto False
    window hide

    # /сцена з очима русалки через декілька секунд з прозорості/
    show eyea
    with slow_dissolve

    centered "{size=300}{shader=wave}Кінець{/shader}{/size}"(what_color=gui.accent_color)
    return
